InDeviceMex/TM4C123/TM4C123_GPIO_LCD1602/xDriver_MCU/Driver_Header/MPU/MPU_Peripheral/MPU_Register.h
#define MPU_RASR_S_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR_S_DIS         ((uint32_t)0x00000000u)
#define MPU_RASR_S_EN          ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR_R_TEX_MASK      ((uint32_t)0x00380000u)
#define MPU_RASR_R_TEX_BIT       (19u)
#define MPU_RASR_R_TEX_NC        ((uint32_t)0x00000000u)
#define MPU_RASR_R_TEX_WB_WRA    ((uint32_t)0x00080000u)
#define MPU_RASR_R_TEX_WT_NWA    ((uint32_t)0x00100000u)
#define MPU_RASR_R_TEX_WB_NWA    ((uint32_t)0x00180000u)

#define MPU_RASR_TEX_MASK        ((uint32_t)0x00000007u)
#define MPU_RASR_TEX_NC          ((uint32_t)0x00000000u)
#define MPU_RASR_TEX_WB_WRA      ((uint32_t)0x00000001u)
#define MPU_RASR_TEX_WT_NWA      ((uint32_t)0x00000002u)
#define MPU_RASR_TEX_WB_NWA      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define MPU_RASR_R_AP_MASK      ((uint32_t)0x07000000u)
#define MPU_RASR_R_AP_BIT       (24u)
#define MPU_RASR_R_AP_NANA      ((uint32_t)0x00000000u)
#define MPU_RASR_R_AP_RWNA      ((uint32_t)0x01000000u)
#define MPU_RASR_R_AP_RWRO      ((uint32_t)0x02000000u)
#define MPU_RASR_R_AP_RWRW      ((uint32_t)0x03000000u)
#define MPU_RASR_R_AP_RONA      ((uint32_t)0x05000000u)
#define MPU_RASR_R_AP_RORO      ((uint32_t)0x06000000u)

#define MPU_RASR_AP_MASK      ((uint32_t)0x00000007u)
#define MPU_RASR_AP_NANA      ((uint32_t)0x00000000u)
#define MPU_RASR_AP_RWNA      ((uint32_t)0x00000001u)
#define MPU_RASR_AP_RWRO      ((uint32_t)0x00000002u)
#define MPU_RASR_AP_RWRW      ((uint32_t)0x00000003u)
#define MPU_RASR_AP_RONA      ((uint32_t)0x00000005u)
#define MPU_RASR_AP_RORO      ((uint32_t)0x00000006u)
/*--------*/


/*--------*/
#define MPU_RASR_R_XN_MASK      ((uint32_t)0x10000000u)
#define MPU_RASR_R_XN_BIT       (28u)
#define MPU_RASR_R_XN_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR_R_XN_EN        ((uint32_t)0x10000000u)

#define MPU_RASR_XN_MASK       ((uint32_t)0x00000001u)
#define MPU_RASR_XN_DIS        ((uint32_t)0x00000000u)
#define MPU_RASR_XN_EN         ((uint32_t)0x00000001u)
/*--------*/

/**********************************************************************************************
**************************************6 RBAR1 ***********************************************
**********************************************************************************************/
#define MPU_RBAR1            (((MPU_RBAR_TypeDef*)(MPU_BASE+MPU_RBAR1_OFFSET )))
#define MPU_RBAR1_R          (*((volatile uint32_t *)(MPU_BASE+MPU_RBAR1_OFFSET)))


/*--------*/
#define MPU_RBAR1_R_REGION_MASK      ((uint32_t)0x0000000Fu)
#define MPU_RBAR1_R_REGION_BIT       (0u)
#define MPU_RBAR1_R_REGION_REG0      ((uint32_t)0x00000000u)
#define MPU_RBAR1_R_REGION_REG1      ((uint32_t)0x00000001u)
#define MPU_RBAR1_R_REGION_REG2      ((uint32_t)0x00000002u)
#define MPU_RBAR1_R_REGION_REG3      ((uint32_t)0x00000003u)
#define MPU_RBAR1_R_REGION_REG4      ((uint32_t)0x00000004u)
#define MPU_RBAR1_R_REGION_REG5      ((uint32_t)0x00000005u)
#define MPU_RBAR1_R_REGION_REG6      ((uint32_t)0x00000006u)
#define MPU_RBAR1_R_REGION_REG7      ((uint32_t)0x00000007u)
#define MPU_RBAR1_R_REGION_REG8      ((uint32_t)0x00000008u)
#define MPU_RBAR1_R_REGION_REG9      ((uint32_t)0x00000009u)
#define MPU_RBAR1_R_REGION_REG10     ((uint32_t)0x0000000Au)
#define MPU_RBAR1_R_REGION_REG11     ((uint32_t)0x0000000Bu)
#define MPU_RBAR1_R_REGION_REG12     ((uint32_t)0x0000000Cu)
#define MPU_RBAR1_R_REGION_REG13     ((uint32_t)0x0000000Du)
#define MPU_RBAR1_R_REGION_REG14     ((uint32_t)0x0000000Eu)
#define MPU_RBAR1_R_REGION_REG15     ((uint32_t)0x0000000Fu)

#define MPU_RBAR1_REGION_MASK        ((uint32_t)0x0000000Fu)
#define MPU_RBAR1_REGION_REG0        ((uint32_t)0x00000000u)
#define MPU_RBAR1_REGION_REG1        ((uint32_t)0x00000001u)
#define MPU_RBAR1_REGION_REG2        ((uint32_t)0x00000002u)
#define MPU_RBAR1_REGION_REG3        ((uint32_t)0x00000003u)
#define MPU_RBAR1_REGION_REG4        ((uint32_t)0x00000004u)
#define MPU_RBAR1_REGION_REG5        ((uint32_t)0x00000005u)
#define MPU_RBAR1_REGION_REG6        ((uint32_t)0x00000006u)
#define MPU_RBAR1_REGION_REG7        ((uint32_t)0x00000007u)
#define MPU_RBAR1_REGION_REG8        ((uint32_t)0x00000008u)
#define MPU_RBAR1_REGION_REG9        ((uint32_t)0x00000009u)
#define MPU_RBAR1_REGION_REG10       ((uint32_t)0x0000000Au)
#define MPU_RBAR1_REGION_REG11       ((uint32_t)0x0000000Bu)
#define MPU_RBAR1_REGION_REG12       ((uint32_t)0x0000000Cu)
#define MPU_RBAR1_REGION_REG13       ((uint32_t)0x0000000Du)
#define MPU_RBAR1_REGION_REG14       ((uint32_t)0x0000000Eu)
#define MPU_RBAR1_REGION_REG15       ((uint32_t)0x0000000Fu)
/*--------*/


/*--------*/
#define MPU_RBAR1_R_VALID_MASK      ((uint32_t)0x00000010u)
#define MPU_RBAR1_R_VALID_BIT       (4u)
#define MPU_RBAR1_R_VALID_DIS       ((uint32_t)0x00000000u)
#define MPU_RBAR1_R_VALID_EN        ((uint32_t)0x00000010u)

#define MPU_RBAR1_VALID_MASK        ((uint32_t)0x00000001u)
#define MPU_RBAR1_VALID_DIS         ((uint32_t)0x00000000u)
#define MPU_RBAR1_VALID_EN          ((uint32_t)0x00000001u)
/*--------*/


/*--------*/
#define MPU_RBAR1_R_ADDR_MASK      ((uint32_t)0xFFFFFFE0u)
#define MPU_RBAR1_R_ADDR_BIT       (5u)

#define MPU_RBAR1_ADDR_MASK        ((uint32_t)0x01FFFFFFu)
/*--------*/


/**********************************************************************************************
**************************************7 RASR1 ***********************************************
**********************************************************************************************/

#define MPU_RASR1            (((MPU_RASR_TypeDef*)(MPU_BASE+MPU_RASR1_OFFSET )))
#define MPU_RASR1_R          (*((volatile uint32_t *)(MPU_BASE+MPU_RASR1_OFFSET)))



/*--------*/
#define MPU_RASR1_R_ENABLE_MASK      ((uint32_t)0x00000001u)
#define MPU_RASR1_R_ENABLE_BIT       (0u)
#define MPU_RASR1_R_ENABLE_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR1_R_ENABLE_EN        ((uint32_t)0x00000001u)

#define MPU_RASR1_ENABLE_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR1_ENABLE_DIS         ((uint32_t)0x00000000u)
#define MPU_RASR1_ENABLE_EN          ((uint32_t)0x00000001u)
/*--------*/


/*--------*/
#define MPU_RASR1_R_SIZE_MASK      ((uint32_t)0x0000003Eu)
#define MPU_RASR1_R_SIZE_BIT       (1u)
#define MPU_RASR1_R_SIZE_32B       ((uint32_t)0x00000008u)
#define MPU_RASR1_R_SIZE_1KB       ((uint32_t)0x00000012u)
#define MPU_RASR1_R_SIZE_1MB       ((uint32_t)0x00000026u)
#define MPU_RASR1_R_SIZE_1GB       ((uint32_t)0x0000003Au)
#define MPU_RASR1_R_SIZE_4GB       ((uint32_t)0x0000003Eu)

#define MPU_RASR1_SIZE_MASK        ((uint32_t)0x0000001Fu)
#define MPU_RASR1_SIZE_32B         ((uint32_t)0x00000004u)
#define MPU_RASR1_SIZE_1KB         ((uint32_t)0x00000009u)
#define MPU_RASR1_SIZE_1MB         ((uint32_t)0x00000013u)
#define MPU_RASR1_SIZE_1GB         ((uint32_t)0x0000001Du)
#define MPU_RASR1_SIZE_4GB         ((uint32_t)0x0000001Fu)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD0_MASK      ((uint32_t)0x00000100u)
#define MPU_RASR1_R_SRD0_BIT       (8u)
#define MPU_RASR1_R_SRD0_EN           ((uint32_t)0x00000000u)
#define MPU_RASR1_R_SRD0_DIS       ((uint32_t)0x00000100u)

